39-animals-rails-api/animals-backend/app/controllers/api/v1/animals_controller.rb

    def index
        animals = Animal.all
---
SELECT "animals".* FROM "animals"

    def create
        species = Species.find_or_create_by(name: params[:species])
        animal = Animal.new(name: params[:name], gender: params[:gender].to_i, species: species)
        if animal.save
---
INSERT INTO "species" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Griffin"], ["created_at", "2020-11-24 21:37:26.671050"], ["updated_at", "2020-11-24 21:37:26.671050"]]
SELECT "species".* FROM "species" WHERE "species"."name" = ? LIMIT ?  [["name", "Griffin"], ["LIMIT", 1]]
INSERT INTO "animals" ("name", "gender", "species_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rickenbocker"], ["gender", 0], ["species_id", 8], ["created_at", "2020-11-24 21:37:26.675341"], ["updated_at", "2020-11-24 21:37:26.675341"]]